In [58]:
import pandas as pd
import numpy as np

In [59]:
data1=np.random.randn(4,3)

In [60]:
data1

array([[ 1.07670215, -1.00897016,  0.35702118],
       [-0.23201592, -0.76810882,  0.90407348],
       [ 1.35293222, -0.7123029 ,  0.00734657],
       [-1.12377964,  1.05435469, -0.53783996]])

In [61]:
dataFrame1=pd.DataFrame(data1)

In [62]:
dataFrame1

          0         1         2
0  1.076702 -1.008970  0.357021
1 -0.232016 -0.768109  0.904073
2  1.352932 -0.712303  0.007347
3 -1.123780  1.054355 -0.537840

yeniDataFrame=pd.DataFrame(data1,index=["ayberg","ali","veli","nihat"],columns=["maas","yas","calısma saati"])

In [64]:
yeniDataFrame

            maas       yas  calısma saati
ayberg  1.076702 -1.008970       0.357021
ali    -0.232016 -0.768109       0.904073
veli    1.352932 -0.712303       0.007347
nihat  -1.123780  1.054355      -0.537840

In [65]:
yeniDataFrame["yas"]

ayberg   -1.008970
ali      -0.768109
veli     -0.712303
nihat     1.054355
Name: yas, dtype: float64

In [66]:
yeniDataFrame[["maas","yas"]]

            maas       yas
ayberg  1.076702 -1.008970
ali    -0.232016 -0.768109
veli    1.352932 -0.712303
nihat  -1.123780  1.054355

In [67]:
yeniDataFrame.loc["ayberg"]

maas             1.076702
yas             -1.008970
calısma saati    0.357021
Name: ayberg, dtype: float64

In [68]:
yeniDataFrame.iloc[1]

maas            -0.232016
yas             -0.768109
calısma saati    0.904073
Name: ali, dtype: float64

In [69]:
yeniDataFrame["emeklilik yasi"]=yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [70]:
yeniDataFrame

            maas       yas  calısma saati  emeklilik yasi
ayberg  1.076702 -1.008970       0.357021       -2.017940
ali    -0.232016 -0.768109       0.904073       -1.536218
veli    1.352932 -0.712303       0.007347       -1.424606
nihat  -1.123780  1.054355      -0.537840        2.108709

In [71]:
yeniDataFrame.drop("emeklilik yasi",axis=1)

            maas       yas  calısma saati
ayberg  1.076702 -1.008970       0.357021
ali    -0.232016 -0.768109       0.904073
veli    1.352932 -0.712303       0.007347
nihat  -1.123780  1.054355      -0.537840

In [72]:
yeniDataFrame.drop("nihat",axis=0)

            maas       yas  calısma saati  emeklilik yasi
ayberg  1.076702 -1.008970       0.357021       -2.017940
ali    -0.232016 -0.768109       0.904073       -1.536218
veli    1.352932 -0.712303       0.007347       -1.424606

In [73]:
yeniDataFrame

            maas       yas  calısma saati  emeklilik yasi
ayberg  1.076702 -1.008970       0.357021       -2.017940
ali    -0.232016 -0.768109       0.904073       -1.536218
veli    1.352932 -0.712303       0.007347       -1.424606
nihat  -1.123780  1.054355      -0.537840        2.108709

In [74]:
yeniDataFrame.drop("emeklilik yasi",axis=1,inplace=True)

In [75]:
yeniDataFrame

            maas       yas  calısma saati
ayberg  1.076702 -1.008970       0.357021
ali    -0.232016 -0.768109       0.904073
veli    1.352932 -0.712303       0.007347
nihat  -1.123780  1.054355      -0.537840

In [76]:
yeniDataFrame.loc["ayberg"]["yas"]

-1.0089701589821478

In [77]:
yeniDataFrame.loc["ayberg","yas"]

-1.0089701589821478

In [78]:
yeniDataFrame[yeniDataFrame<0]

            maas       yas  calısma saati
ayberg       NaN -1.008970            NaN
ali    -0.232016 -0.768109            NaN
veli         NaN -0.712303            NaN
nihat  -1.123780       NaN       -0.53784

In [79]:
yeniDataFrame[yeniDataFrame["yas"]>0]

          maas       yas  calısma saati
nihat -1.12378  1.054355       -0.53784

In [80]:
yeniDataFrame.reset_index()

    index      maas       yas  calısma saati
0  ayberg  1.076702 -1.008970       0.357021
1     ali -0.232016 -0.768109       0.904073
2    veli  1.352932 -0.712303       0.007347
3   nihat -1.123780  1.054355      -0.537840

In [81]:
yeniDataFrame

            maas       yas  calısma saati
ayberg  1.076702 -1.008970       0.357021
ali    -0.232016 -0.768109       0.904073
veli    1.352932 -0.712303       0.007347
nihat  -1.123780  1.054355      -0.537840

In [82]:
yeniIndexListesi=["ayb","ali","vel","nih"]

In [83]:
yeniDataFrame["yeniIndex"]=yeniIndexListesi

In [84]:
yeniDataFrame.set_index("yeniIndex",inplace=True)

In [85]:
yeniDataFrame

               maas       yas  calısma saati
yeniIndex
ayb        1.076702 -1.008970       0.357021
ali       -0.232016 -0.768109       0.904073
vel        1.352932 -0.712303       0.007347
nih       -1.123780  1.054355      -0.537840

In [86]:
yeniDataFrame.loc["ayb"]

maas             1.076702
yas             -1.008970
calısma saati    0.357021
Name: ayb, dtype: float64

## multiIndex

In [89]:
ilkIndexler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
icIndexler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [92]:
birlemisIndex=list(zip(ilkIndexler,icIndexler))
birlemisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [94]:
birlemisIndex1=pd.MultiIndex.from_tuples(birlemisIndex)
birlemisIndex1

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [96]:
benimCizgiFilmListem=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [97]:
cizgiFilmNumpyDizisi=np.array(benimCizgiFilmListem)

In [98]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDizisi,index=birlemisIndex1,columns=["yas","meslek"])

In [99]:
cizgiFilmDataFrame

                   yas meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [100]:
cizgiFilmDataFrame.loc["Simpson"]

      yas meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [103]:
cizgiFilmDataFrame.loc["Simpson"].loc["Bart"]

yas       10
meslek     B
Name: Bart, dtype: object

In [106]:
cizgiFilmDataFrame.index.names=["Film Adi","Isim"]
cizgiFilmDataFrame

                   yas meslek
Film Adi   Isim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F